Revit 2027 API
SpatialElementFromToCalculationPoints.ToPosition Property
 The "to" position of spatial element connecting calculation point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ ToPosition { get; set; }
Public Property ToPosition As XYZ
	Get
	Set
public:
property XYZ^ ToPosition {
	XYZ^ get ();
	void set (XYZ^ value);
}
member ToPosition : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentException |  When setting this property: toPosition must be on the opposite side of the family's host from the "from" position.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
SpatialElementFromToCalculationPoints Class
Autodesk.Revit.DB Namespace